app/controllers/api/games_controller.rb

  def index
    # respond with json representing all the games in the database
    # but, only include their id and playerName attributes
    # limiting the data sent to only what's used by /games
    render json: Game.all, include: [:id, :playerName]
---
SELECT "games".* FROM "games"

  def create
    game = Game.create(game_params)
    setUpNewGame(game)

    if game.save
      @game = Game.find_by(id: game.id)
---
INSERT INTO "games" ("playerName", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["playerName", "Dave"], ["created_at", "2019-01-24 17:22:41.175044"], ["updated_at", "2019-01-24 17:22:41.175044"]]
UPDATE "games" SET "moves" = $1, "updated_at" = $2 WHERE "games"."id" = $3  [["moves", 1], ["updated_at", "2019-01-22 18:22:21.211786"], ["id", 22]]
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]

  def update
    if game_params[:newMove]
      makeMove(game_params[:newMove])
      @game.moves += 1
      @game.save
      if @game.over
        @game.status = false
        @game.save
      end
    elsif game_params[:endTurn]
      dealUpToSeven(@game)
      @game.moves = 0
      @game.save
      if @game.over
        @game.status = false
        @game.save
      end
    end

    game = Game.find_by(id: @game.id)
---
UPDATE "games" SET "moves" = $1, "updated_at" = $2 WHERE "games"."id" = $3  [["moves", 0], ["updated_at", "2019-01-22 18:22:25.283548"], ["id", 22]]
UPDATE "games" SET "status" = $1, "updated_at" = $2 WHERE "games"."id" = $3  [["status", false], ["updated_at", "2019-01-22 20:09:33.705352"], ["id", 23]]
UPDATE "games" SET "moves" = $1, "updated_at" = $2 WHERE "games"."id" = $3  [["moves", 0], ["updated_at", "2019-01-23 17:27:34.090158"], ["id", 22]]
UPDATE "games" SET "status" = $1, "updated_at" = $2 WHERE "games"."id" = $3  [["status", false], ["updated_at", "2019-01-24 22:21:44.284706"], ["id", 22]]
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]

  def set_game
    @game = Game.find_by(id: params[:id])
---
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]

  def dealUpToSeven(game)
    numOfCardsInHand = game.hand.cards.length
    if (numOfCardsInHand < 7)
      numToDeal = (7-numOfCardsInHand)
      numOfCardsInDeck = game.deck.cards.length
      cardsToDeal = game.deck.cards.slice(-numToDeal, (numOfCardsInDeck-1))
      cardsToDeal.each do |card|
        card.whereIsCard = game.hand
        card.save
---
SELECT  "hands".* FROM "hands" WHERE "hands"."game_id" = $1 LIMIT $2  [["game_id", 22], ["LIMIT", 1]]
SELECT  "decks".* FROM "decks" WHERE "decks"."game_id" = $1 LIMIT $2  [["game_id", 22], ["LIMIT", 1]]
UPDATE "cards" SET "whereIsCard_type" = $1, "whereIsCard_id" = $2, "updated_at" = $3 WHERE "cards"."id" = $4  [["whereIsCard_type", "Hand"], ["whereIsCard_id", 14], ["updated_at", "2019-01-24 17:22:42.948777"], ["id", 1368]]

  def makeMove(move)
    card = Card.find_by(id: move[:card_id])
    pile = Pile.find_by(id: move[:pile_id])
    card.whereIsCard = pile
    card.save
---
SELECT  "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 1162], ["LIMIT", 1]]
SELECT  "piles".* FROM "piles" WHERE "piles"."id" = $1 LIMIT $2  [["id", 48], ["LIMIT", 1]]
UPDATE "cards" SET "whereIsCard_id" = $1, "whereIsCard_type" = $2, "updated_at" = $3 WHERE "cards"."id" = $4  [["whereIsCard_id", 48], ["whereIsCard_type", "Pile"], ["updated_at", "2019-01-23 17:27:25.962090"], ["id", 1162]]

  def setUpNewGame(game)
    game.status = true

    game.moves = 0

    Deck.create(game_id: game.id)

    (2..99).to_a.shuffle!.each do |value|
      card = game.deck.cards.create({"value": value})
    end

    Hand.create(game_id: game.id)

    2.times{Pile.create({"asc":true, game_id: game.id})}
    2.times{Pile.create({"asc":false, game_id: game.id})}

    game.save
---
INSERT INTO "decks" ("game_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["game_id", 24], ["created_at", "2019-01-24 17:22:41.276565"], ["updated_at", "2019-01-24 17:22:41.276565"]]
INSERT INTO "cards" ("value", "whereIsCard_type", "whereIsCard_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["value", 8], ["whereIsCard_type", "Deck"], ["whereIsCard_id", 16], ["created_at", "2019-01-24 17:22:41.352740"], ["updated_at", "2019-01-24 17:22:41.352740"]]
INSERT INTO "hands" ("game_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["game_id", 24], ["created_at", "2019-01-24 17:22:42.812184"], ["updated_at", "2019-01-24 17:22:42.812184"]]
INSERT INTO "piles" ("asc", "game_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["asc", true], ["game_id", 24], ["created_at", "2019-01-24 17:22:42.842718"], ["updated_at", "2019-01-24 17:22:42.842718"]]
INSERT INTO "piles" ("asc", "game_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["asc", false], ["game_id", 24], ["created_at", "2019-01-24 17:22:42.853119"], ["updated_at", "2019-01-24 17:22:42.853119"]]
UPDATE "games" SET "status" = $1, "updated_at" = $2, "moves" = $3 WHERE "games"."id" = $4  [["status", true], ["updated_at", "2019-01-24 17:22:42.861054"], ["moves", 0], ["id", 24]]