app/models/game.rb

  def topMostCardsAsc
    # iterate over this game's piles
    # return a collection of the top most cards on the ascending piles
    cards = []
    self.piles.each do |pile|
---
SELECT "piles".* FROM "piles" WHERE "piles"."game_id" = $1  [["game_id", 22]]

  def playableOnAsc
    topCards = self.topMostCardsAsc
    array = []
    # iterate over the cards in this game's hand
    self.hand.cards.each do |card|
---
SELECT  "hands".* FROM "hands" WHERE "hands"."game_id" = $1 LIMIT $2  [["game_id", 23], ["LIMIT", 1]]

  def canDealMoreCardsToHand
    # check if there are cards in the deck
    if self.deck.cards.length < 1
---
SELECT  "decks".* FROM "decks" WHERE "decks"."game_id" = $1 LIMIT $2  [["game_id", 22], ["LIMIT", 1]]

  def over
    # check if won
    if self.deck.cards.length == 0 && self.hand.cards.length == 0
---
SELECT  "decks".* FROM "decks" WHERE "decks"."game_id" = $1 LIMIT $2  [["game_id", 22], ["LIMIT", 1]]